<?php
/**
 * User: Major
 * Date: 2018/4/1
 * Time: 23:23
 */
/**
 * 不用临时的变量 交换两个数的两种方法
 */
$a = 10;
$b = 20;

$a = $a + $b; // $b 还是 20
$b = $a - $b; // 想要交换 则取出 $a给 $b , $a = $a -$b
$a = $a - $b; // 再将 $b 的值给 $a ----> $b =

//var_dump($a, $b);

$c = 10;
$d = 20;
$c = $c ^ $d;
$d = $c ^ $d;
$c = $c ^ $d;

/**
 * $c  1010
 * $d 10100
 *
 * $c = $c ^ $d  ==> 11110
 * $d = $c ^ $d ==>  10100 -> 01010
 *
 * 与0异或 1^0 -> 1 0^0 -> 0
 *
 *  $d = $c ^ $d ^ $d
 *  $c = $c ^ $d ^ ($c ^ $d )^ $d
 *  两个相同的值，异或得0，0与任何值异或得起其本身
 */

var_dump($c, $d);